Catalogs/ТелеграмСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ТелеграмСервис</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмСтатусыИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмВидыВходящихОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийТекстАвто</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборыУсловийАвто</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкиАвто</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящийТекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмНаборУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмОбработка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмНаборУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТелеграмСтатусыИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТелеграмСтатусыИспользования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТелеграмВидыВходящихОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТелеграмВидыВходящихОбновлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветКонтекстнойКлавиатуры</Name>
					<Comment>CallbackQuery</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВстроенныйЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбранныйЛинейныйРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТелеграмСервис/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если ПометкаУдаления Тогда
			Статус = Перечисления.ТелеграмСтатусыИспользования.Выключен;
		КонецЕсли;
		
		Если ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.Сообщение Тогда
			Если ВходящийТекст.Количество() = 0 Тогда
				Сообщить("Не задан входящий текст");
				Отказ = Истина;
			Иначе
				ВходящийТекстАвто = "";
				Для Каждого ТекСтрока Из ВходящийТекст Цикл
					Если ВходящийТекстАвто <> "" Тогда
						ВходящийТекстАвто = ВходящийТекстАвто + "; ";
					КонецЕсли;
					ВходящийТекстАвто = ВходящийТекстАвто + ТекСтрока.ВидСравнения + " " + ТекСтрока.Значение;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры Тогда
			Если ВходящиеДанные.Количество() = 0 Тогда
				Сообщить("Не заданы входящие данные");
				//Отказ = Истина;
			Иначе
				ВходящийТекстАвто = "";
				Для Каждого ТекСтрока Из ВходящиеДанные Цикл
					Если ВходящийТекстАвто <> "" Тогда
						ВходящийТекстАвто = ВходящийТекстАвто + "; ";
					КонецЕсли;
					ВходящийТекстАвто = ВходящийТекстАвто + ТекСтрока.ВидСравнения + " " + ТекСтрока.Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		НаборыУсловийАвто = НаборыУсловий.Количество();
		ОбработкиАвто = ЭтотОбъект.Обработки.Количество();
		
	КонецЕсли;
	
КонецПроцедуры
